[
  {
    "activityName": "Daily Fruit Run",
    "activityDay": "April-4-2025",
    "activityDescription": "We all fill the tote bags",
    "activityStartTime": "06:00",
    "activityStopTime": "08:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We begin our first Friday (April 4th) with an early morning run at sunrise to the nearby market near Yitel Premium (Building 1, No. 1119 Yan'an West Road) where we fill our bags with as much fruit as we can carry.\n\nWe need to bring our tote bags.Remember that sunrise is early (~6am) in Shanghai, so prepare for an early start."
  },
  {
    "activityName": "Attendees Arrive at Airport",
    "activityDay": "April-4-2025",
    "activityDescription": "Arrival day for all participants",
    "activityStartTime": "06:00",
    "activityStopTime": "23:30",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Throughout Friday (April 4th), we'll be welcoming everyone as they arrive at Shanghai airport. Some of us will be stationed there to greet you and help with transportation to our housing at Yitel Premium in the Changning District (Building 1, No. 1119 Yan'an West Road).\n\nWe've arranged pickup from the airport! If your flight gets delayed, don't worry – we'll be monitoring all arrival information and will make sure nobody is left behind."
  },
  {
    "activityName": "Wash Fruits & Cafe Setup",
    "activityDay": "April-4-2025",
    "activityDescription": "Setup the cafe for the day",
    "activityStartTime": "08:00",
    "activityStopTime": "09:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We go to our first venue, Bottle Dream (上海市长宁区利西路143号), which is located in a commercial area downtown with lots of foot traffic. We wash all the fruit, and get the cafe ready before guests arrive.\n\nWe chalk the menu on the board for the juices we found for that day. We pick what records we want to play on the record player.\n\nEveryone sets up their games ready to be played, positioning them around the cafe for maximum visibility."
  },
  {
    "activityName": "Venue Setup",
    "activityDay": "April-4-2025",
    "activityDescription": "Attendees arrive and help with venue setup",
    "activityStartTime": "09:00",
    "activityStopTime": "19:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "As more attendees arrive from the airport, we all pitch in to transform our space at Bottle Dream (上海市长宁区利西路143号) into a welcoming juice cafe and game showcase.\n\nBottle Dream is in a very commercial area downtown with lots of foot traffic, which will be perfect for attracting visitors to try our games and juices.\n\nWe set up the juicer station, making sure it's both functional and visually appealing. The sound of records playing in the background keeps our energy up as we arrange booths, hang decorations, and prepare welcome materials."
  },
  {
    "activityName": "Round Table Dinner",
    "activityDay": "April-4-2025",
    "activityDescription": "Welcome dinner for all attendees",
    "activityStartTime": "19:15",
    "activityStopTime": "23:30",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "After a day of setup and arrivals, we gather for our first meal together on Friday evening."
  },
  {
    "activityName": "Daily Fruit Run",
    "activityDay": "April-5-2025",
    "activityDescription": "We all fill the tote bags",
    "activityStartTime": "06:00",
    "activityStopTime": "08:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We begin Saturday (April 5th) early morning at sunrise with our daily run to the nearby market in the Changning District where we fill our bags with as much fruit as we can carry."
  },
  {
    "activityName": "Breakfast",
    "activityDay": "April-5-2025",
    "activityDescription": "Morning meal",
    "activityStartTime": "07:00",
    "activityStopTime": "09:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Breakfast at the hotel! First full day in Shanghai :)"
  },
  {
    "activityName": "Saturday Venue Arrival",
    "activityDay": "April-5-2025",
    "activityDescription": "Arriving at the venue",
    "activityStartTime": "08:00",
    "activityStopTime": "10:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We arrive at Bottle Dream (上海市长宁区利西路143号) with our bags full of fresh fruit, ready for our first full day of operation.\n\nWe gather for a quick briefing, assigning roles for the day – who will be primarily making juice, who will be demonstrating games, who will be our ambassadors going out with sandwich boards. We also decide on our rotation schedule so everyone gets a chance to experience different aspects of our pop-up.\n\nBottle Dream is in a commercial downtown area with lots of foot traffic, which should bring in plenty of curious visitors to try our games and juices."
  },
  {
    "activityName": "Decoration & Booth Setup",
    "activityDay": "April-5-2025",
    "activityDescription": "Final preparations for opening",
    "activityStartTime": "08:00",
    "activityStopTime": "12:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We refresh our decorations at Bottle Dream and make any adjustments needed based on yesterday's setup. The space looks even better today as we add finishing touches – more fairy lights here, a better arrangement of the seating there.\n\nEach person puts the final touches on their game booth, making sure everything is working perfectly. We test all the equipment one more time – the juicers, the record player, the payment system.\n\nWe chalk menu on the board for the juices we found for that day. We pick what records we want to play on the record player, selecting music that creates a welcoming, energetic atmosphere."
  },
  {
    "activityName": "Customer Session",
    "activityDay": "April-5-2025",
    "activityDescription": "Ticket holders visit the shop",
    "activityStartTime": "12:00",
    "activityStopTime": "17:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "People come into our Bottle Dream cafe and are so amazed at what we're making! We're super busy making juice for everyone and also showing off our games.\n\nThe downtown location brings a mix of reserved ticket holders and curious walk-ins, creating a dynamic atmosphere. We're constantly shifting between making juice, explaining our games, and making sure everyone feels welcome."
  },
  {
    "activityName": "Promotion Group",
    "activityDay": "April-5-2025",
    "activityDescription": "First group promoting the cafe",
    "activityStartTime": "12:15",
    "activityStopTime": "14:30",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Our first promotion team heads out with colorful sandwich boards, samples of our drinks, and flyers about our games. We spread out through the neighborhood around Bottle Dream, becoming walking advertisements for our pop-up cafe.\n\nIt's a bit intimidating at first, approaching strangers in a foreign country, but people are generally curious and receptive. We quickly learn which approaches work best – offering tiny sample cups of our most colorful drinks definitely gets attention!\n\nWe discover that having someone who speaks even a little Mandarin makes a huge difference."
  },
  {
    "activityName": "Cleanup & Closing",
    "activityDay": "April-5-2025",
    "activityDescription": "End of day cleanup",
    "activityStartTime": "17:00",
    "activityStopTime": "18:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We close shop at Bottle Dream as sunset approaches and wash all the juice glasses."
  },
  {
    "activityName": "Huashan Greenland Picnic",
    "activityDay": "April-5-2025",
    "activityDescription": "Group picnic with sharing activity",
    "activityStartTime": "18:00",
    "activityStopTime": "19:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We go to Huashan Greenland park and have some food together on picnic blankets."
  },
  {
    "activityName": "Exploration Walk",
    "activityDay": "April-5-2025",
    "activityDescription": "Group walk back to hotel",
    "activityStartTime": "19:00",
    "activityStopTime": "21:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We walk back to our accommodations at Yitel Premium together, taking a scenic route that allows us to explore a bit of the Changning District. We stick together as a group for safety, especially as it's after sunset now.\n\nAlong the way, we stop occasionally to admire interesting sights or pop into small local shops that catch our eye.\n\nWe make sure to return before it gets too late, mindful of safety in an unfamiliar city."
  },
  {
    "activityName": "Daily Fruit Run",
    "activityDay": "April-6-2025",
    "activityDescription": "We all fill the tote bags",
    "activityStartTime": "06:00",
    "activityStopTime": "08:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We begin Sunday (April 6th) early morning at sunrise with our daily run to the nearby market in the Changning District where we fill our bags with as much fruit as we can carry. By now, some vendors are greeting us by name, and we're getting better at communicating despite language barriers.\n\nWe're buying a variety of fruits for our juices. We're also on the lookout for any unusual local fruits we haven't tried yet."
  },
  {
    "activityName": "Breakfast",
    "activityDay": "April-6-2025",
    "activityDescription": "Morning meal",
    "activityStartTime": "07:00",
    "activityStopTime": "09:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "It's our second full breakfast together at Yitel Premium, and we're starting to develop little morning routines and friendships."
  },
  {
    "activityName": "Sunday Setup",
    "activityDay": "April-6-2025",
    "activityDescription": "Morning preparations for cafe opening",
    "activityStartTime": "09:00",
    "activityStopTime": "12:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Arrive at Bottle Dream to prepare for the day. Wash and prepare the fruit from the morning's market run. Chalk the menu on the board with the day's juice options. Set up the record player with music for the day.\n\nPrepare the game booths around the cafe for visibility. Review any technical issues from the previous day and make necessary adjustments. Ensure the payment system is working properly. Complete final touches before opening."
  },
  {
    "activityName": "Sunday Customer Session",
    "activityDay": "April-6-2025",
    "activityDescription": "Visitors enjoy games and juices",
    "activityStartTime": "12:00",
    "activityStopTime": "17:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Open Bottle Dream to visitors. Make juices and serve customers throughout the afternoon. Demonstrate games and answer questions about their development. Rotate staff between juice-making, game demonstrations, and general hosting duties.\n\nSunday may bring different visitors than Saturday, possibly with more families or groups of friends."
  },
  {
    "activityName": "Sunday Promotion Team",
    "activityDay": "April-6-2025",
    "activityDescription": "Team promotes the cafe in the neighborhood",
    "activityStartTime": "12:30",
    "activityStopTime": "14:30",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "A team heads out with sandwich boards and sample drinks to promote the cafe in the surrounding area. Target areas with high Sunday foot traffic, such as parks and shopping areas. Hand out flyers with the cafe location and information about our pop-up event.\n\nBasic promotion pitch: games made by teenagers, fresh juice, and a cultural exchange experience. Return to the cafe after the promotion period to help with the customer session."
  },
  {
    "activityName": "Sunday Cleanup & Closing",
    "activityDay": "April-6-2025",
    "activityDescription": "End of day cleanup",
    "activityStartTime": "17:00",
    "activityStopTime": "18:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Close Bottle Dream for the day. Wash juice glasses and clean juicers. Tidy up the game booths and reset them for the next day. Clean counters and floors. Take inventory of supplies and note what needs to be purchased. Secure all equipment and personal items before leaving."
  },
  {
    "activityName": "???",
    "activityDay": "April-6-2025",
    "activityDescription": "Open evening - suggest activities!",
    "activityStartTime": "18:00",
    "activityStopTime": "22:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "This evening time slot is intentionally left open for Hack Clubbers to suggest and organize activities. Make a PR to edit this to any idea you have."
  },
  {
    "activityName": "Daily Fruit Run",
    "activityDay": "April-7-2025",
    "activityDescription": "We all fill the tote bags",
    "activityStartTime": "06:00",
    "activityStopTime": "08:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We begin Monday (April 7th) early morning at sunrise with our daily run to the nearby market in the Changning District where we fill our bags with as much fruit as we can carry. Monday brings new energy to the market, with fresh deliveries arriving from regional farms.\n\nWe've become quite strategic about our purchases, knowing exactly which combinations have been most popular and which new experiments we want to try. Our regular vendors now set aside some of their best items for us, appreciating our daily business."
  },
  {
    "activityName": "Breakfast",
    "activityDay": "April-7-2025",
    "activityDescription": "Morning meal",
    "activityStartTime": "07:00",
    "activityStopTime": "09:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Monday breakfast brings a mix of energy levels at Yitel Premium - some are eager to start the week while others are still recovering from the weekend. The hotel breakfast buffet offers a good selection this morning, but many of us now have favorite local spots we frequent.\n\nWe use breakfast time to coordinate the day's plans - what's on the menu today? Do we need to restock any supplies? The team shares stories from the weekend's customer interactions and which games were most popular."
  },
  {
    "activityName": "Monday Setup",
    "activityDay": "April-7-2025",
    "activityDescription": "Morning preparations for cafe opening",
    "activityStartTime": "09:00",
    "activityStopTime": "12:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Arrive at Bottle Dream to prepare for the day. Wash and prepare the fruit from the morning's market run. Chalk the menu on the board with the day's juice options. Set up the record player with music for the day.\n\nPrepare the game booths around the cafe for visibility. Review any technical issues from the previous day and make necessary adjustments. Ensure the payment system is working properly. Complete final touches before opening."
  },
  {
    "activityName": "Monday Customer Session",
    "activityDay": "April-7-2025",
    "activityDescription": "Visitors enjoy games and juices",
    "activityStartTime": "12:00",
    "activityStopTime": "17:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Open Bottle Dream to visitors. Make juices and serve customers throughout the afternoon. Demonstrate games and answer questions about their development. Rotate staff between juice-making, game demonstrations, and general hosting duties.\n\nWeekday visitors may include office workers on lunch breaks and have different timing patterns than weekend visitors. Keep the record player going with welcoming music throughout the session."
  },
  {
    "activityName": "Monday Promotion Team",
    "activityDay": "April-7-2025",
    "activityDescription": "Team promotes the cafe in business districts",
    "activityStartTime": "11:30",
    "activityStopTime": "14:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "A team heads out with sandwich boards and sample drinks to promote the cafe in nearby office buildings and business districts. Target the lunch hour when office workers are out. Hand out flyers with the cafe location and information about our pop-up event.\n\nBasic promotion pitch: games made by teenagers, fresh juice, and a cultural exchange experience. Return to the cafe after the promotion period to help with the customer session."
  },
  {
    "activityName": "Monday Cleanup & Closing",
    "activityDay": "April-7-2025",
    "activityDescription": "End of day cleanup",
    "activityStartTime": "17:00",
    "activityStopTime": "18:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Close Bottle Dream for the day. Wash juice glasses and clean juicers. Tidy up the game booths and reset them for the next day. Clean counters and floors. Take inventory of supplies and note what needs to be purchased. Begin setting aside items that will need to be packed for tomorrow's move to the new venue."
  },
  {
    "activityName": "The Bund & Ferry Ride",
    "activityDay": "April-7-2025",
    "activityDescription": "Evening sightseeing by the river",
    "activityStartTime": "18:30",
    "activityStopTime": "22:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Visit The Bund, Shanghai's famous waterfront area along the Huangpu River. View the iconic skyline with its mix of historic colonial-era buildings on one side and ultra-modern skyscrapers of Pudong on the other. Take time to walk along the promenade and admire the contrasting architecture that represents Shanghai's past and present.\n\nTake the ferry across the Huangpu River to experience the city from the water. This gives a unique perspective of Shanghai's impressive skyline, especially as buildings illuminate for the evening. The ferry ride is an authentic local experience and more affordable than tourist cruises.\n\nReturn to Yitel Premium after this evening exploration. Be sure to bring cameras to capture the spectacular night views of Shanghai's skyline."
  },
  {
    "activityName": "Daily Fruit Run",
    "activityDay": "April-8-2025",
    "activityDescription": "We all fill the tote bags",
    "activityStartTime": "06:00",
    "activityStopTime": "08:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We begin Tuesday (April 8th) early morning at sunrise with our daily run to the market. Today is a transition day as we'll be moving to our second venue and housing location later.\n\nTuesday's market seems less crowded, allowing us more time to chat with vendors and learn about their produce. Some vendors are sad to hear we're moving to a different part of town.\n\nSome of us have started experimenting with non-fruit ingredients that might complement our drinks – herbs, spices, or local specialties recommended by friendly vendors. We're constantly learning and adapting our menu based on what's available and what our customers enjoy."
  },
  {
    "activityName": "Breakfast",
    "activityDay": "April-8-2025",
    "activityDescription": "Morning meal",
    "activityStartTime": "07:00",
    "activityStopTime": "09:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Tuesday breakfast at Yitel Premium is our last at this location as we'll be moving to our second venue and housing today. We discuss the logistics of the move to Yiju Hotel (Shanghai Caohejing Development Zone) and SparkLabs venue.\n\nThe conversation focuses on our experiences with the local culture so far and any interesting customer interactions from previous days. We also brainstorm how to adapt our approach for the new location, which is near many large technology companies."
  },
  {
    "activityName": "Venue Change - Moving Day",
    "activityDay": "April-8-2025",
    "activityDescription": "Moving to second venue and housing",
    "activityStartTime": "09:00",
    "activityStopTime": "13:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Today we transition from our first venue (Bottle Dream) to our second venue, SparkLabs (漕河泾开发区公园-东门 上海市徐汇区平果路与桂果路交叉口正南方向33米左右). We also move our housing from Yitel Premium to Yiju Hotel near Caohejing Development Zone.\n\nWe carefully pack up all our equipment and personal belongings. Everyone helps with the move, ensuring nothing gets left behind.\n\nSparkLabs is located in a hi-tech park near many large technology companies. Our hope is that local engineers and game developers from these companies will visit our cafe to try the games that Hack Clubbers made."
  },
  {
    "activityName": "New Venue Setup",
    "activityDay": "April-8-2025",
    "activityDescription": "Setting up at SparkLabs",
    "activityStartTime": "13:00",
    "activityStopTime": "17:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Arrive at SparkLabs in the Caohejing hi-tech park to set up our new space. Unpack equipment and arrange the cafe layout. Position game booths throughout the space. Set up the juice bar with all necessary equipment. Create signage and menus appropriate for this new location.\n\nThe environment at SparkLabs is different from Bottle Dream - it's located in a technology-focused area near companies. Prepare the space with this different context in mind."
  },
  {
    "activityName": "Tuesday Soft Opening at New Venue",
    "activityDay": "April-8-2025",
    "activityDescription": "First visitors at SparkLabs",
    "activityStartTime": "17:00",
    "activityStopTime": "19:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Host a brief soft opening at SparkLabs to test our setup with a small number of visitors. Make juices and demonstrate games. Note any issues with the new setup or space that need to be adjusted before full operations tomorrow. This limited session helps identify any changes needed to the layout or processes in the new venue."
  },
  {
    "activityName": "???",
    "activityDay": "April-8-2025",
    "activityDescription": "Open evening - suggest activities!",
    "activityStartTime": "19:00",
    "activityStopTime": "23:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "This evening time slot is intentionally left open for Hack Clubbers to suggest and organize activities. Make a PR to edit this to any idea you have."
  },
  {
    "activityName": "Daily Fruit Run",
    "activityDay": "April-9-2025",
    "activityDescription": "We all fill the tote bags",
    "activityStartTime": "06:00",
    "activityStopTime": "08:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We begin Wednesday (April 9th) early morning at sunrise with our daily run to a new market near our Caohejing accommodations where we fill our bags with as much fruit as we can carry. We need to establish new relationships with the vendors in this area.\n\nBy Wednesday, we've become experienced fruit shoppers."
  },
  {
    "activityName": "Breakfast",
    "activityDay": "April-9-2025",
    "activityDescription": "Morning meal",
    "activityStartTime": "07:00",
    "activityStopTime": "09:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Mid-week breakfast at our new accommodation, Yiju Hotel in the Caohejing Development Zone, has everyone in good spirits as we've hit our stride with the cafe operations. We're exploring our new surroundings and finding breakfast options in this tech-focused area.\n\nWe start talking about what we'll miss most about Shanghai when we leave, and how we might incorporate some of these experiences into our work back home. There's also discussion about documentation - we want to make sure we capture all the knowledge and experiences we've gained."
  },
  {
    "activityName": "Wednesday Setup at SparkLabs",
    "activityDay": "April-9-2025",
    "activityDescription": "Morning preparations at new venue",
    "activityStartTime": "09:00",
    "activityStopTime": "12:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Arrive at SparkLabs to prepare for our first full day at the new venue. Implement any adjustments identified during yesterday's soft opening. Wash and prepare the fruit from the morning's market run. Chalk the menu on the board with the day's juice options.\n\nPrepare the game booths around the cafe for visibility. Ensure all technical aspects are functioning properly. Complete final touches before opening."
  },
  {
    "activityName": "Wednesday Customer Session",
    "activityDay": "April-9-2025",
    "activityDescription": "Tech professionals visit SparkLabs cafe",
    "activityStartTime": "12:00",
    "activityStopTime": "17:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Open SparkLabs to visitors. Make juices and serve customers throughout the afternoon. Demonstrate games and answer questions about their development. Rotate staff between juice-making, game demonstrations, and general hosting duties.\n\nThis location in the hi-tech park may bring different types of visitors, potentially including technology professionals from nearby companies. Be prepared to answer more technical questions about the games."
  },
  {
    "activityName": "Wednesday Promotion Team",
    "activityDay": "April-9-2025",
    "activityDescription": "Team targets tech company offices",
    "activityStartTime": "11:30",
    "activityStopTime": "14:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "A team heads out with sandwich boards and sample drinks to promote the cafe in the surrounding tech companies. Target the lunch hour when tech workers are out. Hand out flyers with the cafe location and information about our pop-up event.\n\nPromotional materials focus on the games and their development, which may interest the tech-oriented audience in this area. Return to the cafe after the promotion period to help with the customer session."
  },
  {
    "activityName": "Wednesday Cleanup & Closing",
    "activityDay": "April-9-2025",
    "activityDescription": "End of day cleanup",
    "activityStartTime": "17:00",
    "activityStopTime": "18:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Close SparkLabs for the day. Wash juice glasses and clean juicers. Tidy up the game booths and reset them for the next day. Clean counters and floors. Take inventory of supplies and note what needs to be purchased. Discuss any adjustments needed for tomorrow based on today's experience in the new venue."
  },
  {
    "activityName": "China Art Museum Visit",
    "activityDay": "April-9-2025",
    "activityDescription": "Optional cultural excursion",
    "activityStartTime": "16:00",
    "activityStopTime": "19:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "This is an optional activity for those interested in art and culture. While some team members remain at SparkLabs to maintain cafe operations, interested participants can visit the China Art Museum, housed in the distinctive former China Pavilion from the 2010 Shanghai World Expo.\n\nThis massive inverted pyramid structure contains one of the largest collections of modern Chinese art in the world. Explore various exhibitions spanning multiple floors that showcase the development of Chinese art from the late 19th century to contemporary works.\n\nTravel as a group from SparkLabs to the museum. Those participating should coordinate with cafe staff to ensure adequate coverage at SparkLabs during their absence. Return in time for dinner and evening activities."
  },
  {
    "activityName": "Daily Fruit Run",
    "activityDay": "April-10-2025",
    "activityDescription": "We all fill the tote bags",
    "activityStartTime": "06:00",
    "activityStopTime": "08:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We begin Thursday (April 10th) early morning at sunrise with our daily run to the market near Caohejing where we fill our bags with as much fruit as we can carry. There's a bittersweet feeling to today's market run, knowing it's our second-to-last day at the cafe.\n\nThe vendors in this tech district seem different from those in Changning - perhaps more accustomed to catering to office workers rather than residents. We splurge a bit on premium fruits for special farewell menu items, wanting to make our final days at SparkLabs memorable for our visitors from the nearby tech companies."
  },
  {
    "activityName": "Breakfast",
    "activityDay": "April-10-2025",
    "activityDescription": "Morning meal",
    "activityStartTime": "07:00",
    "activityStopTime": "09:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Breakfast at Yiju Hotel takes on a reflective tone as we realize we're approaching our final days in Shanghai. We share favorite memories from the trip so far and talk about our plans for the farewell menu items we'll create with our premium fruit purchases.\n\nWe also discuss logistics for our departures - when is everyone leaving? Do we need to arrange airport transportation from Caohejing?"
  },
  {
    "activityName": "Thursday Setup at SparkLabs",
    "activityDay": "April-10-2025",
    "activityDescription": "Penultimate day preparations",
    "activityStartTime": "09:00",
    "activityStopTime": "12:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Arrive at SparkLabs to prepare for our second day at this venue. Wash and prepare the fruit from the morning's market run, including the premium selections purchased today. Chalk the menu on the board with the day's juice options.\n\nPrepare the game booths around the cafe for visibility. Ensure all technical aspects are functioning properly. Complete final touches before opening."
  },
  {
    "activityName": "Thursday Customer Session",
    "activityDay": "April-10-2025",
    "activityDescription": "Penultimate day with visitors",
    "activityStartTime": "12:00",
    "activityStopTime": "17:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Open SparkLabs to visitors. Make juices and serve customers throughout the afternoon. Demonstrate games and answer questions about their development. Rotate staff between juice-making, game demonstrations, and general hosting duties."
  },
  {
    "activityName": "Thursday Promotion Team",
    "activityDay": "April-10-2025",
    "activityDescription": "Final promotional push",
    "activityStartTime": "11:30",
    "activityStopTime": "14:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "A team heads out to nearby tech companies to promote our final day tomorrow. Hand out flyers that emphasize this is the last chance to visit our pop-up cafe. Collect feedback from those who have already visited about their experience.\n\nThis is our last major promotional effort of the trip. Return to the cafe after the promotion period to help with the customer session."
  },
  {
    "activityName": "Thursday Cleanup & Closing",
    "activityDay": "April-10-2025",
    "activityDescription": "End of day cleanup",
    "activityStartTime": "17:00",
    "activityStopTime": "18:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Close SparkLabs for the day. Wash juice glasses and clean juicers. Tidy up the game booths and reset them for the final day."
  },
  {
    "activityName": "Daily Fruit Run",
    "activityDay": "April-11-2025",
    "activityDescription": "We all fill the tote bags",
    "activityStartTime": "06:00",
    "activityStopTime": "08:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We begin our final Friday (April 11th) with an early morning sunrise run to the market near Caohejing where we fill our bags with as much fruit as we can carry. There's a ceremonial quality to this last market visit – even though we've only been visiting this particular market for a few days, we've become recognizable.\n\nWe're selective about our purchases today, buying just enough for our final day at SparkLabs without leaving excess. We take extra photos and videos to remember this special part of our experience in Shanghai."
  },
  {
    "activityName": "Breakfast",
    "activityDay": "April-11-2025",
    "activityDescription": "Morning meal",
    "activityStartTime": "07:00",
    "activityStopTime": "09:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Our final breakfast together!"
  },
  {
    "activityName": "Final Day Setup",
    "activityDay": "April-11-2025",
    "activityDescription": "Last day preparations at SparkLabs",
    "activityStartTime": "09:00",
    "activityStopTime": "12:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Arrive at SparkLabs to prepare for our final day of operation. Wash and prepare the fruit from the morning's market run. Chalk a special farewell menu on the board. Create simple decorations indicating this is the final day of our pop-up cafe.\n\nPrepare the game booths for the last time. "
  },
  {
    "activityName": "Grand Finale Customer Session",
    "activityDay": "April-11-2025",
    "activityDescription": "Final day serving customers",
    "activityStartTime": "12:00",
    "activityStopTime": "17:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Open SparkLabs for our final day of operation. Make juices and serve customers throughout the afternoon. Demonstrate games and answer questions about their development. Rotate staff between juice-making, game demonstrations, and general hosting duties.\n\nAs this is our final day, collect contact information from those interested in staying connected. Document the experience through photos and notes."
  },
  {
    "activityName": "Final Promotion Team",
    "activityDay": "April-11-2025",
    "activityDescription": "Team invites final visitors",
    "activityStartTime": "11:30",
    "activityStopTime": "14:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "We attract our final attendees into the cafe."
  },
  {
    "activityName": "Final Cleanup & Packing",
    "activityDay": "April-11-2025",
    "activityDescription": "Closing the cafe for good",
    "activityStartTime": "17:00",
    "activityStopTime": "20:00",
    "activityBackgroundColor": "#fff",
    "activityDetailedContent": "Close SparkLabs for the final time. Complete a thorough cleanup of all areas. Pack all equipment and personal items for travel. Dismantle the game booths and juice bar setup. Return the space to its original condition.\n\nThis cleanup session is longer than usual as we're completely packing up rather than preparing for another day. Take before and after photos to document the space."
  }
]
